; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x12-y12-t5-k66666-l66666-p50-neargoal-d6)
(:domain grid)
(:objects f0-0f f1-0f f2-0f f3-0f f4-0f f5-0f f6-0f f7-0f f8-0f f9-0f f10-0f f11-0f f0-1f f1-1f f2-1f f3-1f f4-1f f5-1f f6-1f f7-1f f8-1f f9-1f f10-1f f11-1f f0-2f f1-2f f2-2f f3-2f f4-2f f5-2f f6-2f f7-2f f8-2f f9-2f f10-2f f11-2f f0-3f f1-3f f2-3f f3-3f f4-3f f5-3f f6-3f f7-3f f8-3f f9-3f f10-3f f11-3f f0-4f f1-4f f2-4f f3-4f f4-4f f5-4f f6-4f f7-4f f8-4f f9-4f f10-4f f11-4f f0-5f f1-5f f2-5f f3-5f f4-5f f5-5f f6-5f f7-5f f8-5f f9-5f f10-5f f11-5f f0-6f f1-6f f2-6f f3-6f f4-6f f5-6f f6-6f f7-6f f8-6f f9-6f f10-6f f11-6f f0-7f f1-7f f2-7f f3-7f f4-7f f5-7f f6-7f f7-7f f8-7f f9-7f f10-7f f11-7f f0-8f f1-8f f2-8f f3-8f f4-8f f5-8f f6-8f f7-8f f8-8f f9-8f f10-8f f11-8f f0-9f f1-9f f2-9f f3-9f f4-9f f5-9f f6-9f f7-9f f8-9f f9-9f f10-9f f11-9f f0-10f f1-10f f2-10f f3-10f f4-10f f5-10f f6-10f f7-10f f8-10f f9-10f f10-10f f11-10f f0-11f f1-11f f2-11f f3-11f f4-11f f5-11f f6-11f f7-11f f8-11f f9-11f f10-11f f11-11f shape0 shape1 shape2 shape3 shape4 key0-0 key0-1 key0-2 key0-3 key0-4 key0-5 key1-0 key1-1 key1-2 key1-3 key1-4 key1-5 key2-0 key2-1 key2-2 key2-3 key2-4 key2-5 key3-0 key3-1 key3-2 key3-3 key3-4 key3-5 key4-0 key4-1 key4-2 key4-3 key4-4 key4-5)
(:init
(at key0-0 f10-9f)
(at key0-1 f8-11f)
(at key0-2 f5-3f)
(at key0-3 f8-5f)
(at key0-4 f1-2f)
(at key0-5 f9-1f)
(at key1-0 f10-7f)
(at key1-1 f8-5f)
(at key1-2 f9-11f)
(at key1-3 f7-9f)
(at key1-4 f10-0f)
(at key1-5 f5-5f)
(at key2-0 f6-10f)
(at key2-2 f8-1f)
(at key2-3 f9-9f)
(at key2-4 f4-9f)
(at key2-5 f8-2f)
(at key3-0 f0-7f)
(at key3-1 f7-1f)
(at key3-2 f2-1f)
(at key3-3 f8-6f)
(at key3-4 f0-10f)
(at key3-5 f6-2f)
(at key4-0 f1-5f)
(at key4-1 f10-11f)
(at key4-2 f5-7f)
(at key4-3 f3-4f)
(at key4-4 f1-3f)
(at key4-5 f8-8f)
(at-robot f6-1f)
(conn f0-0f f0-1f)
(conn f0-0f f1-0f)
(conn f0-10f f0-11f)
(conn f0-10f f0-9f)
(conn f0-10f f1-10f)
(conn f0-11f f0-10f)
(conn f0-11f f1-11f)
(conn f0-1f f0-0f)
(conn f0-1f f0-2f)
(conn f0-1f f1-1f)
(conn f0-2f f0-1f)
(conn f0-2f f0-3f)
(conn f0-2f f1-2f)
(conn f0-3f f0-2f)
(conn f0-3f f0-4f)
(conn f0-3f f1-3f)
(conn f0-4f f0-3f)
(conn f0-4f f0-5f)
(conn f0-4f f1-4f)
(conn f0-5f f0-4f)
(conn f0-5f f0-6f)
(conn f0-5f f1-5f)
(conn f0-6f f0-5f)
(conn f0-6f f0-7f)
(conn f0-6f f1-6f)
(conn f0-7f f0-6f)
(conn f0-7f f0-8f)
(conn f0-7f f1-7f)
(conn f0-8f f0-7f)
(conn f0-8f f0-9f)
(conn f0-8f f1-8f)
(conn f0-9f f0-10f)
(conn f0-9f f0-8f)
(conn f0-9f f1-9f)
(conn f1-0f f0-0f)
(conn f1-0f f1-1f)
(conn f1-0f f2-0f)
(conn f1-10f f0-10f)
(conn f1-10f f1-11f)
(conn f1-10f f1-9f)
(conn f1-10f f2-10f)
(conn f1-11f f0-11f)
(conn f1-11f f1-10f)
(conn f1-11f f2-11f)
(conn f1-1f f0-1f)
(conn f1-1f f1-0f)
(conn f1-1f f1-2f)
(conn f1-1f f2-1f)
(conn f1-2f f0-2f)
(conn f1-2f f1-1f)
(conn f1-2f f1-3f)
(conn f1-2f f2-2f)
(conn f1-3f f0-3f)
(conn f1-3f f1-2f)
(conn f1-3f f1-4f)
(conn f1-3f f2-3f)
(conn f1-4f f0-4f)
(conn f1-4f f1-3f)
(conn f1-4f f1-5f)
(conn f1-4f f2-4f)
(conn f1-5f f0-5f)
(conn f1-5f f1-4f)
(conn f1-5f f1-6f)
(conn f1-5f f2-5f)
(conn f1-6f f0-6f)
(conn f1-6f f1-5f)
(conn f1-6f f1-7f)
(conn f1-6f f2-6f)
(conn f1-7f f0-7f)
(conn f1-7f f1-6f)
(conn f1-7f f1-8f)
(conn f1-7f f2-7f)
(conn f1-8f f0-8f)
(conn f1-8f f1-7f)
(conn f1-8f f1-9f)
(conn f1-8f f2-8f)
(conn f1-9f f0-9f)
(conn f1-9f f1-10f)
(conn f1-9f f1-8f)
(conn f1-9f f2-9f)
(conn f10-0f f10-1f)
(conn f10-0f f11-0f)
(conn f10-0f f9-0f)
(conn f10-10f f10-11f)
(conn f10-10f f10-9f)
(conn f10-10f f11-10f)
(conn f10-10f f9-10f)
(conn f10-11f f10-10f)
(conn f10-11f f11-11f)
(conn f10-11f f9-11f)
(conn f10-1f f10-0f)
(conn f10-1f f10-2f)
(conn f10-1f f11-1f)
(conn f10-1f f9-1f)
(conn f10-2f f10-1f)
(conn f10-2f f10-3f)
(conn f10-2f f11-2f)
(conn f10-2f f9-2f)
(conn f10-3f f10-2f)
(conn f10-3f f10-4f)
(conn f10-3f f11-3f)
(conn f10-3f f9-3f)
(conn f10-4f f10-3f)
(conn f10-4f f10-5f)
(conn f10-4f f11-4f)
(conn f10-4f f9-4f)
(conn f10-5f f10-4f)
(conn f10-5f f10-6f)
(conn f10-5f f11-5f)
(conn f10-5f f9-5f)
(conn f10-6f f10-5f)
(conn f10-6f f10-7f)
(conn f10-6f f11-6f)
(conn f10-6f f9-6f)
(conn f10-7f f10-6f)
(conn f10-7f f10-8f)
(conn f10-7f f11-7f)
(conn f10-7f f9-7f)
(conn f10-8f f10-7f)
(conn f10-8f f10-9f)
(conn f10-8f f11-8f)
(conn f10-8f f9-8f)
(conn f10-9f f10-10f)
(conn f10-9f f10-8f)
(conn f10-9f f11-9f)
(conn f10-9f f9-9f)
(conn f11-0f f10-0f)
(conn f11-0f f11-1f)
(conn f11-10f f10-10f)
(conn f11-10f f11-11f)
(conn f11-10f f11-9f)
(conn f11-11f f10-11f)
(conn f11-11f f11-10f)
(conn f11-1f f10-1f)
(conn f11-1f f11-0f)
(conn f11-1f f11-2f)
(conn f11-2f f10-2f)
(conn f11-2f f11-1f)
(conn f11-2f f11-3f)
(conn f11-3f f10-3f)
(conn f11-3f f11-2f)
(conn f11-3f f11-4f)
(conn f11-4f f10-4f)
(conn f11-4f f11-3f)
(conn f11-4f f11-5f)
(conn f11-5f f10-5f)
(conn f11-5f f11-4f)
(conn f11-5f f11-6f)
(conn f11-6f f10-6f)
(conn f11-6f f11-5f)
(conn f11-6f f11-7f)
(conn f11-7f f10-7f)
(conn f11-7f f11-6f)
(conn f11-7f f11-8f)
(conn f11-8f f10-8f)
(conn f11-8f f11-7f)
(conn f11-8f f11-9f)
(conn f11-9f f10-9f)
(conn f11-9f f11-10f)
(conn f11-9f f11-8f)
(conn f2-0f f1-0f)
(conn f2-0f f2-1f)
(conn f2-0f f3-0f)
(conn f2-10f f1-10f)
(conn f2-10f f2-11f)
(conn f2-10f f2-9f)
(conn f2-10f f3-10f)
(conn f2-11f f1-11f)
(conn f2-11f f2-10f)
(conn f2-11f f3-11f)
(conn f2-1f f1-1f)
(conn f2-1f f2-0f)
(conn f2-1f f2-2f)
(conn f2-1f f3-1f)
(conn f2-2f f1-2f)
(conn f2-2f f2-1f)
(conn f2-2f f2-3f)
(conn f2-2f f3-2f)
(conn f2-3f f1-3f)
(conn f2-3f f2-2f)
(conn f2-3f f2-4f)
(conn f2-3f f3-3f)
(conn f2-4f f1-4f)
(conn f2-4f f2-3f)
(conn f2-4f f2-5f)
(conn f2-4f f3-4f)
(conn f2-5f f1-5f)
(conn f2-5f f2-4f)
(conn f2-5f f2-6f)
(conn f2-5f f3-5f)
(conn f2-6f f1-6f)
(conn f2-6f f2-5f)
(conn f2-6f f2-7f)
(conn f2-6f f3-6f)
(conn f2-7f f1-7f)
(conn f2-7f f2-6f)
(conn f2-7f f2-8f)
(conn f2-7f f3-7f)
(conn f2-8f f1-8f)
(conn f2-8f f2-7f)
(conn f2-8f f2-9f)
(conn f2-8f f3-8f)
(conn f2-9f f1-9f)
(conn f2-9f f2-10f)
(conn f2-9f f2-8f)
(conn f2-9f f3-9f)
(conn f3-0f f2-0f)
(conn f3-0f f3-1f)
(conn f3-0f f4-0f)
(conn f3-10f f2-10f)
(conn f3-10f f3-11f)
(conn f3-10f f3-9f)
(conn f3-10f f4-10f)
(conn f3-11f f2-11f)
(conn f3-11f f3-10f)
(conn f3-11f f4-11f)
(conn f3-1f f2-1f)
(conn f3-1f f3-0f)
(conn f3-1f f3-2f)
(conn f3-1f f4-1f)
(conn f3-2f f2-2f)
(conn f3-2f f3-1f)
(conn f3-2f f3-3f)
(conn f3-2f f4-2f)
(conn f3-3f f2-3f)
(conn f3-3f f3-2f)
(conn f3-3f f3-4f)
(conn f3-3f f4-3f)
(conn f3-4f f2-4f)
(conn f3-4f f3-3f)
(conn f3-4f f3-5f)
(conn f3-4f f4-4f)
(conn f3-5f f2-5f)
(conn f3-5f f3-4f)
(conn f3-5f f3-6f)
(conn f3-5f f4-5f)
(conn f3-6f f2-6f)
(conn f3-6f f3-5f)
(conn f3-6f f3-7f)
(conn f3-6f f4-6f)
(conn f3-7f f2-7f)
(conn f3-7f f3-6f)
(conn f3-7f f3-8f)
(conn f3-7f f4-7f)
(conn f3-8f f2-8f)
(conn f3-8f f3-7f)
(conn f3-8f f3-9f)
(conn f3-8f f4-8f)
(conn f3-9f f2-9f)
(conn f3-9f f3-10f)
(conn f3-9f f3-8f)
(conn f3-9f f4-9f)
(conn f4-0f f3-0f)
(conn f4-0f f4-1f)
(conn f4-0f f5-0f)
(conn f4-10f f3-10f)
(conn f4-10f f4-11f)
(conn f4-10f f4-9f)
(conn f4-10f f5-10f)
(conn f4-11f f3-11f)
(conn f4-11f f4-10f)
(conn f4-11f f5-11f)
(conn f4-1f f3-1f)
(conn f4-1f f4-0f)
(conn f4-1f f4-2f)
(conn f4-1f f5-1f)
(conn f4-2f f3-2f)
(conn f4-2f f4-1f)
(conn f4-2f f4-3f)
(conn f4-2f f5-2f)
(conn f4-3f f3-3f)
(conn f4-3f f4-2f)
(conn f4-3f f4-4f)
(conn f4-3f f5-3f)
(conn f4-4f f3-4f)
(conn f4-4f f4-3f)
(conn f4-4f f4-5f)
(conn f4-4f f5-4f)
(conn f4-5f f3-5f)
(conn f4-5f f4-4f)
(conn f4-5f f4-6f)
(conn f4-5f f5-5f)
(conn f4-6f f3-6f)
(conn f4-6f f4-5f)
(conn f4-6f f4-7f)
(conn f4-6f f5-6f)
(conn f4-7f f3-7f)
(conn f4-7f f4-6f)
(conn f4-7f f4-8f)
(conn f4-7f f5-7f)
(conn f4-8f f3-8f)
(conn f4-8f f4-7f)
(conn f4-8f f4-9f)
(conn f4-8f f5-8f)
(conn f4-9f f3-9f)
(conn f4-9f f4-10f)
(conn f4-9f f4-8f)
(conn f4-9f f5-9f)
(conn f5-0f f4-0f)
(conn f5-0f f5-1f)
(conn f5-0f f6-0f)
(conn f5-10f f4-10f)
(conn f5-10f f5-11f)
(conn f5-10f f5-9f)
(conn f5-10f f6-10f)
(conn f5-11f f4-11f)
(conn f5-11f f5-10f)
(conn f5-11f f6-11f)
(conn f5-1f f4-1f)
(conn f5-1f f5-0f)
(conn f5-1f f5-2f)
(conn f5-1f f6-1f)
(conn f5-2f f4-2f)
(conn f5-2f f5-1f)
(conn f5-2f f5-3f)
(conn f5-2f f6-2f)
(conn f5-3f f4-3f)
(conn f5-3f f5-2f)
(conn f5-3f f5-4f)
(conn f5-3f f6-3f)
(conn f5-4f f4-4f)
(conn f5-4f f5-3f)
(conn f5-4f f5-5f)
(conn f5-4f f6-4f)
(conn f5-5f f4-5f)
(conn f5-5f f5-4f)
(conn f5-5f f5-6f)
(conn f5-5f f6-5f)
(conn f5-6f f4-6f)
(conn f5-6f f5-5f)
(conn f5-6f f5-7f)
(conn f5-6f f6-6f)
(conn f5-7f f4-7f)
(conn f5-7f f5-6f)
(conn f5-7f f5-8f)
(conn f5-7f f6-7f)
(conn f5-8f f4-8f)
(conn f5-8f f5-7f)
(conn f5-8f f5-9f)
(conn f5-8f f6-8f)
(conn f5-9f f4-9f)
(conn f5-9f f5-10f)
(conn f5-9f f5-8f)
(conn f5-9f f6-9f)
(conn f6-0f f5-0f)
(conn f6-0f f6-1f)
(conn f6-0f f7-0f)
(conn f6-10f f5-10f)
(conn f6-10f f6-11f)
(conn f6-10f f6-9f)
(conn f6-10f f7-10f)
(conn f6-11f f5-11f)
(conn f6-11f f6-10f)
(conn f6-11f f7-11f)
(conn f6-1f f5-1f)
(conn f6-1f f6-0f)
(conn f6-1f f6-2f)
(conn f6-1f f7-1f)
(conn f6-2f f5-2f)
(conn f6-2f f6-1f)
(conn f6-2f f6-3f)
(conn f6-2f f7-2f)
(conn f6-3f f5-3f)
(conn f6-3f f6-2f)
(conn f6-3f f6-4f)
(conn f6-3f f7-3f)
(conn f6-4f f5-4f)
(conn f6-4f f6-3f)
(conn f6-4f f6-5f)
(conn f6-4f f7-4f)
(conn f6-5f f5-5f)
(conn f6-5f f6-4f)
(conn f6-5f f6-6f)
(conn f6-5f f7-5f)
(conn f6-6f f5-6f)
(conn f6-6f f6-5f)
(conn f6-6f f6-7f)
(conn f6-6f f7-6f)
(conn f6-7f f5-7f)
(conn f6-7f f6-6f)
(conn f6-7f f6-8f)
(conn f6-7f f7-7f)
(conn f6-8f f5-8f)
(conn f6-8f f6-7f)
(conn f6-8f f6-9f)
(conn f6-8f f7-8f)
(conn f6-9f f5-9f)
(conn f6-9f f6-10f)
(conn f6-9f f6-8f)
(conn f6-9f f7-9f)
(conn f7-0f f6-0f)
(conn f7-0f f7-1f)
(conn f7-0f f8-0f)
(conn f7-10f f6-10f)
(conn f7-10f f7-11f)
(conn f7-10f f7-9f)
(conn f7-10f f8-10f)
(conn f7-11f f6-11f)
(conn f7-11f f7-10f)
(conn f7-11f f8-11f)
(conn f7-1f f6-1f)
(conn f7-1f f7-0f)
(conn f7-1f f7-2f)
(conn f7-1f f8-1f)
(conn f7-2f f6-2f)
(conn f7-2f f7-1f)
(conn f7-2f f7-3f)
(conn f7-2f f8-2f)
(conn f7-3f f6-3f)
(conn f7-3f f7-2f)
(conn f7-3f f7-4f)
(conn f7-3f f8-3f)
(conn f7-4f f6-4f)
(conn f7-4f f7-3f)
(conn f7-4f f7-5f)
(conn f7-4f f8-4f)
(conn f7-5f f6-5f)
(conn f7-5f f7-4f)
(conn f7-5f f7-6f)
(conn f7-5f f8-5f)
(conn f7-6f f6-6f)
(conn f7-6f f7-5f)
(conn f7-6f f7-7f)
(conn f7-6f f8-6f)
(conn f7-7f f6-7f)
(conn f7-7f f7-6f)
(conn f7-7f f7-8f)
(conn f7-7f f8-7f)
(conn f7-8f f6-8f)
(conn f7-8f f7-7f)
(conn f7-8f f7-9f)
(conn f7-8f f8-8f)
(conn f7-9f f6-9f)
(conn f7-9f f7-10f)
(conn f7-9f f7-8f)
(conn f7-9f f8-9f)
(conn f8-0f f7-0f)
(conn f8-0f f8-1f)
(conn f8-0f f9-0f)
(conn f8-10f f7-10f)
(conn f8-10f f8-11f)
(conn f8-10f f8-9f)
(conn f8-10f f9-10f)
(conn f8-11f f7-11f)
(conn f8-11f f8-10f)
(conn f8-11f f9-11f)
(conn f8-1f f7-1f)
(conn f8-1f f8-0f)
(conn f8-1f f8-2f)
(conn f8-1f f9-1f)
(conn f8-2f f7-2f)
(conn f8-2f f8-1f)
(conn f8-2f f8-3f)
(conn f8-2f f9-2f)
(conn f8-3f f7-3f)
(conn f8-3f f8-2f)
(conn f8-3f f8-4f)
(conn f8-3f f9-3f)
(conn f8-4f f7-4f)
(conn f8-4f f8-3f)
(conn f8-4f f8-5f)
(conn f8-4f f9-4f)
(conn f8-5f f7-5f)
(conn f8-5f f8-4f)
(conn f8-5f f8-6f)
(conn f8-5f f9-5f)
(conn f8-6f f7-6f)
(conn f8-6f f8-5f)
(conn f8-6f f8-7f)
(conn f8-6f f9-6f)
(conn f8-7f f7-7f)
(conn f8-7f f8-6f)
(conn f8-7f f8-8f)
(conn f8-7f f9-7f)
(conn f8-8f f7-8f)
(conn f8-8f f8-7f)
(conn f8-8f f8-9f)
(conn f8-8f f9-8f)
(conn f8-9f f7-9f)
(conn f8-9f f8-10f)
(conn f8-9f f8-8f)
(conn f8-9f f9-9f)
(conn f9-0f f10-0f)
(conn f9-0f f8-0f)
(conn f9-0f f9-1f)
(conn f9-10f f10-10f)
(conn f9-10f f8-10f)
(conn f9-10f f9-11f)
(conn f9-10f f9-9f)
(conn f9-11f f10-11f)
(conn f9-11f f8-11f)
(conn f9-11f f9-10f)
(conn f9-1f f10-1f)
(conn f9-1f f8-1f)
(conn f9-1f f9-0f)
(conn f9-1f f9-2f)
(conn f9-2f f10-2f)
(conn f9-2f f8-2f)
(conn f9-2f f9-1f)
(conn f9-2f f9-3f)
(conn f9-3f f10-3f)
(conn f9-3f f8-3f)
(conn f9-3f f9-2f)
(conn f9-3f f9-4f)
(conn f9-4f f10-4f)
(conn f9-4f f8-4f)
(conn f9-4f f9-3f)
(conn f9-4f f9-5f)
(conn f9-5f f10-5f)
(conn f9-5f f8-5f)
(conn f9-5f f9-4f)
(conn f9-5f f9-6f)
(conn f9-6f f10-6f)
(conn f9-6f f8-6f)
(conn f9-6f f9-5f)
(conn f9-6f f9-7f)
(conn f9-7f f10-7f)
(conn f9-7f f8-7f)
(conn f9-7f f9-6f)
(conn f9-7f f9-8f)
(conn f9-8f f10-8f)
(conn f9-8f f8-8f)
(conn f9-8f f9-7f)
(conn f9-8f f9-9f)
(conn f9-9f f10-9f)
(conn f9-9f f8-9f)
(conn f9-9f f9-10f)
(conn f9-9f f9-8f)
(holding key2-1)
(key key0-0)
(key key0-1)
(key key0-2)
(key key0-3)
(key key0-4)
(key key0-5)
(key key1-0)
(key key1-1)
(key key1-2)
(key key1-3)
(key key1-4)
(key key1-5)
(key key2-0)
(key key2-1)
(key key2-2)
(key key2-3)
(key key2-4)
(key key2-5)
(key key3-0)
(key key3-1)
(key key3-2)
(key key3-3)
(key key3-4)
(key key3-5)
(key key4-0)
(key key4-1)
(key key4-2)
(key key4-3)
(key key4-4)
(key key4-5)
(key-shape key0-0 shape0)
(key-shape key0-1 shape0)
(key-shape key0-2 shape0)
(key-shape key0-3 shape0)
(key-shape key0-4 shape0)
(key-shape key0-5 shape0)
(key-shape key1-0 shape1)
(key-shape key1-1 shape1)
(key-shape key1-2 shape1)
(key-shape key1-3 shape1)
(key-shape key1-4 shape1)
(key-shape key1-5 shape1)
(key-shape key2-0 shape2)
(key-shape key2-1 shape2)
(key-shape key2-2 shape2)
(key-shape key2-3 shape2)
(key-shape key2-4 shape2)
(key-shape key2-5 shape2)
(key-shape key3-0 shape3)
(key-shape key3-1 shape3)
(key-shape key3-2 shape3)
(key-shape key3-3 shape3)
(key-shape key3-4 shape3)
(key-shape key3-5 shape3)
(key-shape key4-0 shape4)
(key-shape key4-1 shape4)
(key-shape key4-2 shape4)
(key-shape key4-3 shape4)
(key-shape key4-4 shape4)
(key-shape key4-5 shape4)
(lock-shape f0-11f shape2)
(lock-shape f0-3f shape3)
(lock-shape f0-8f shape3)
(lock-shape f1-0f shape4)
(lock-shape f1-11f shape1)
(lock-shape f1-1f shape2)
(lock-shape f1-3f shape3)
(lock-shape f1-5f shape4)
(lock-shape f1-7f shape0)
(lock-shape f10-1f shape1)
(lock-shape f10-7f shape1)
(lock-shape f2-5f shape0)
(lock-shape f2-7f shape3)
(lock-shape f2-8f shape0)
(lock-shape f3-10f shape4)
(lock-shape f3-2f shape2)
(lock-shape f3-5f shape3)
(lock-shape f3-9f shape2)
(lock-shape f4-7f shape0)
(lock-shape f4-8f shape2)
(lock-shape f5-0f shape1)
(lock-shape f6-1f shape4)
(lock-shape f6-8f shape4)
(lock-shape f7-10f shape2)
(lock-shape f7-1f shape3)
(lock-shape f7-2f shape0)
(lock-shape f7-9f shape1)
(lock-shape f8-10f shape0)
(lock-shape f9-6f shape4)
(lock-shape f9-8f shape1)
(locked f0-11f)
(locked f0-3f)
(locked f0-8f)
(locked f1-0f)
(locked f1-11f)
(locked f1-1f)
(locked f1-5f)
(locked f1-7f)
(locked f10-1f)
(locked f10-7f)
(locked f2-5f)
(locked f2-7f)
(locked f2-8f)
(locked f3-10f)
(locked f3-2f)
(locked f3-5f)
(locked f3-9f)
(locked f4-7f)
(locked f4-8f)
(locked f5-0f)
(locked f6-8f)
(locked f7-10f)
(locked f7-2f)
(locked f7-9f)
(locked f8-10f)
(locked f9-6f)
(locked f9-8f)
(open f0-0f)
(open f0-10f)
(open f0-1f)
(open f0-2f)
(open f0-4f)
(open f0-5f)
(open f0-6f)
(open f0-7f)
(open f0-9f)
(open f1-10f)
(open f1-2f)
(open f1-3f)
(open f1-4f)
(open f1-6f)
(open f1-8f)
(open f1-9f)
(open f10-0f)
(open f10-10f)
(open f10-11f)
(open f10-2f)
(open f10-3f)
(open f10-4f)
(open f10-5f)
(open f10-6f)
(open f10-8f)
(open f10-9f)
(open f11-0f)
(open f11-10f)
(open f11-11f)
(open f11-1f)
(open f11-2f)
(open f11-3f)
(open f11-4f)
(open f11-5f)
(open f11-6f)
(open f11-7f)
(open f11-8f)
(open f11-9f)
(open f2-0f)
(open f2-10f)
(open f2-11f)
(open f2-1f)
(open f2-2f)
(open f2-3f)
(open f2-4f)
(open f2-6f)
(open f2-9f)
(open f3-0f)
(open f3-11f)
(open f3-1f)
(open f3-3f)
(open f3-4f)
(open f3-6f)
(open f3-7f)
(open f3-8f)
(open f4-0f)
(open f4-10f)
(open f4-11f)
(open f4-1f)
(open f4-2f)
(open f4-3f)
(open f4-4f)
(open f4-5f)
(open f4-6f)
(open f4-9f)
(open f5-10f)
(open f5-11f)
(open f5-1f)
(open f5-2f)
(open f5-3f)
(open f5-4f)
(open f5-5f)
(open f5-6f)
(open f5-7f)
(open f5-8f)
(open f5-9f)
(open f6-0f)
(open f6-10f)
(open f6-11f)
(open f6-1f)
(open f6-2f)
(open f6-3f)
(open f6-4f)
(open f6-5f)
(open f6-6f)
(open f6-7f)
(open f6-9f)
(open f7-0f)
(open f7-11f)
(open f7-1f)
(open f7-3f)
(open f7-4f)
(open f7-5f)
(open f7-6f)
(open f7-7f)
(open f7-8f)
(open f8-0f)
(open f8-11f)
(open f8-1f)
(open f8-2f)
(open f8-3f)
(open f8-4f)
(open f8-5f)
(open f8-6f)
(open f8-7f)
(open f8-8f)
(open f8-9f)
(open f9-0f)
(open f9-10f)
(open f9-11f)
(open f9-1f)
(open f9-2f)
(open f9-3f)
(open f9-4f)
(open f9-5f)
(open f9-7f)
(open f9-9f)
(place f0-0f)
(place f0-10f)
(place f0-11f)
(place f0-1f)
(place f0-2f)
(place f0-3f)
(place f0-4f)
(place f0-5f)
(place f0-6f)
(place f0-7f)
(place f0-8f)
(place f0-9f)
(place f1-0f)
(place f1-10f)
(place f1-11f)
(place f1-1f)
(place f1-2f)
(place f1-3f)
(place f1-4f)
(place f1-5f)
(place f1-6f)
(place f1-7f)
(place f1-8f)
(place f1-9f)
(place f10-0f)
(place f10-10f)
(place f10-11f)
(place f10-1f)
(place f10-2f)
(place f10-3f)
(place f10-4f)
(place f10-5f)
(place f10-6f)
(place f10-7f)
(place f10-8f)
(place f10-9f)
(place f11-0f)
(place f11-10f)
(place f11-11f)
(place f11-1f)
(place f11-2f)
(place f11-3f)
(place f11-4f)
(place f11-5f)
(place f11-6f)
(place f11-7f)
(place f11-8f)
(place f11-9f)
(place f2-0f)
(place f2-10f)
(place f2-11f)
(place f2-1f)
(place f2-2f)
(place f2-3f)
(place f2-4f)
(place f2-5f)
(place f2-6f)
(place f2-7f)
(place f2-8f)
(place f2-9f)
(place f3-0f)
(place f3-10f)
(place f3-11f)
(place f3-1f)
(place f3-2f)
(place f3-3f)
(place f3-4f)
(place f3-5f)
(place f3-6f)
(place f3-7f)
(place f3-8f)
(place f3-9f)
(place f4-0f)
(place f4-10f)
(place f4-11f)
(place f4-1f)
(place f4-2f)
(place f4-3f)
(place f4-4f)
(place f4-5f)
(place f4-6f)
(place f4-7f)
(place f4-8f)
(place f4-9f)
(place f5-0f)
(place f5-10f)
(place f5-11f)
(place f5-1f)
(place f5-2f)
(place f5-3f)
(place f5-4f)
(place f5-5f)
(place f5-6f)
(place f5-7f)
(place f5-8f)
(place f5-9f)
(place f6-0f)
(place f6-10f)
(place f6-11f)
(place f6-1f)
(place f6-2f)
(place f6-3f)
(place f6-4f)
(place f6-5f)
(place f6-6f)
(place f6-7f)
(place f6-8f)
(place f6-9f)
(place f7-0f)
(place f7-10f)
(place f7-11f)
(place f7-1f)
(place f7-2f)
(place f7-3f)
(place f7-4f)
(place f7-5f)
(place f7-6f)
(place f7-7f)
(place f7-8f)
(place f7-9f)
(place f8-0f)
(place f8-10f)
(place f8-11f)
(place f8-1f)
(place f8-2f)
(place f8-3f)
(place f8-4f)
(place f8-5f)
(place f8-6f)
(place f8-7f)
(place f8-8f)
(place f8-9f)
(place f9-0f)
(place f9-10f)
(place f9-11f)
(place f9-1f)
(place f9-2f)
(place f9-3f)
(place f9-4f)
(place f9-5f)
(place f9-6f)
(place f9-7f)
(place f9-8f)
(place f9-9f)
(shape shape0)
(shape shape1)
(shape shape2)
(shape shape3)
(shape shape4)
)
(:goal (and
(at key0-4 f1-2f)
(at key0-5 f9-1f)
(at key1-5 f5-5f)
(at key2-1 f2-2f)
(at key2-2 f8-1f)
(at key3-0 f0-7f)
(at key3-3 f8-6f)
(at key3-5 f6-2f)
(at key4-4 f1-3f)
))
)

; plan
1. (move f6-1f f5-1f)
   deleted: (at-robot f6-1f)
   added: (at-robot f5-1f)
   goals met: 8 of 9
2. (move f5-1f f4-1f)
   deleted: (at-robot f5-1f)
   added: (at-robot f4-1f)
   goals met: 8 of 9
3. (move f4-1f f3-1f)
   deleted: (at-robot f4-1f)
   added: (at-robot f3-1f)
   goals met: 8 of 9
4. (move f3-1f f2-1f)
   deleted: (at-robot f3-1f)
   added: (at-robot f2-1f)
   goals met: 8 of 9
5. (move f2-1f f2-2f)
   deleted: (at-robot f2-1f)
   added: (at-robot f2-2f)
   goals met: 8 of 9
6. (putdown f2-2f key2-1)
   deleted: (holding key2-1)
   added: (arm-empty) (at key2-1 f2-2f)
   goals met: 9 of 9
